src/cf/InformationRegisters/ИспользованиеРекомендованныхНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИспользованиеРекомендованныхНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияНастроек</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СокращенноеИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючНазначенияИспользования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИспользованиеРекомендованныхНастроек/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает использование рекомедованных настроеки пользователем в базу данных.
//
// Параметры:
//  ИмяФормы                    - Строка                        - Полное имя формы.
//  КлючНазначенияИспользования - Строка                        - Ключ назначения использования.
//  Пользователь                - СправочникСсылка.Пользователи - Пользователь, использующий настройки.
//  ВерсияНастроек              - УникальныйИдентификатор       - Версия используемых рекомендованных настроек.
//
Процедура ЗаписатьИспользованиеНастроек(ИмяФормы, КлючНазначенияИспользования, Пользователь, ВерсияНастроек) Экспорт
	
	СокращенноеИмяФормы = СокращенноеИмяФормы(ИмяФормы);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СокращенноеИмяФормы.Установить(СокращенноеИмяФормы);
	НаборЗаписей.Отбор.КлючНазначенияИспользования.Установить(КлючНазначенияИспользования);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.СокращенноеИмяФормы = СокращенноеИмяФормы;
	НоваяЗапись.КлючНазначенияИспользования = КлючНазначенияИспользования;
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.ВерсияНастроек = ВерсияНастроек;
	НоваяЗапись.ИмяФормы = ИмяФормы;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Преобразует полное имя формы в сокращенное, для хранения в базе данных.
//
// Параметры:
//  ИмяФормы - Строка - Полное имя формы.
// 
// Возвращаемое значение:
//  Строка - Сокращенное имя формы для хранения в базе даннных.
//
Функция СокращенноеИмяФормы(ИмяФормы) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.ИспользованиеРекомендованныхНастроек;
	СокращенноеИмяФормы = ОбщегоНазначенияДокументооборот.СтрХеш(
		ИмяФормы,
		МетаданныеРегистра.Измерения.СокращенноеИмяФормы.Тип.КвалификаторыСтроки.Длина);
	
	Возврат СокращенноеИмяФормы;
	
КонецФункции

// Возвращает текущую версию используемых рекомендованных настроек формы.
//
// Параметры:
//  ИмяФормы                    - Строка                        - Полное имя формы.
//  КлючНазначенияИспользования - Строка                        - Ключ назначения использования.
//  Пользователь                - СправочникСсылка.Пользователи - Пользователь, использующий настройки.
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Текущая версия рекомендованных настроек формы.
//
Функция ТекущаяВерсияНастроек(ИмяФормы, КлючНазначенияИспользования, Пользователь) Экспорт
	
	СокращенноеИмяФормы = СокращенноеИмяФормы(ИмяФормы);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИспользованиеРекомендованныхНастроек.ВерсияНастроек КАК ВерсияНастроек
		|ИЗ
		|	РегистрСведений.ИспользованиеРекомендованныхНастроек КАК ИспользованиеРекомендованныхНастроек
		|ГДЕ
		|	ИспользованиеРекомендованныхНастроек.СокращенноеИмяФормы = &СокращенноеИмяФормы
		|	И ИспользованиеРекомендованныхНастроек.КлючНазначенияИспользования = &КлючНазначенияИспользования
		|	И ИспользованиеРекомендованныхНастроек.Пользователь = &Пользователь");
	
	Запрос.УстановитьПараметр("СокращенноеИмяФормы", СокращенноеИмяФормы);
	Запрос.УстановитьПараметр("КлючНазначенияИспользования", КлючНазначенияИспользования);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекущаяВерсияНастроек = ?(Выборка.Следующий(), Выборка.ВерсияНастроек, УникальныйИдентификаторПустой());
	
	Возврат ТекущаяВерсияНастроек;
	
КонецФункции

#КонецОбласти

#КонецЕсли
